# Домашнее задание к занятию "7.5. Основы golang"

1. Напишите программу для перевода метров в футы (1 фут = 0.3048 метр). Можно запросить исходные данные 
у пользователя, а можно статически задать в коде.
    Для взаимодействия с пользователем можно использовать функцию `Scanf`:
    
    ```
    package main
    
    import "fmt"
    
    func main() {
        fmt.Print("Введите значение в метрах: ")
        var input float64
        fmt.Scanf("%f", &input)
    
        output := fmt.Sprintf("%.2f\n", input / 0.3048)
    
        fmt.Println("Значение в футах равно: ", output)
    }
    ```
 
2. Напишите программу, которая найдет наименьший элемент в любом заданном списке, например:
    ```
    x := []int{48,96,86,68,57,82,63,70,37,34,83,27,19,97,9,17,}
    ```
   ```
    package main
            
    import "fmt"
    
    func main() {
        x := []int{48,2,96,86,3,68,57,82,63,70,37,34,83,27,19,97,9,17,1}
        current := 0
        fmt.Println ("Список: ", x)
        for i, value := range x {
            if (i == 0) {
               current = value 
            } else {
                if (value < current){
                    current = value
                }
            }
        }
        fmt.Println("Наименьшее число: ", current)
    }
    ```
3. Напишите программу, которая выводит числа от 1 до 100, которые делятся на 3. То есть `(3, 6, 9, …)`.

   ```
    package main
    
    import "fmt"
    
    
    func main() {
        
        for i := 1; i <= 100; i++ {
            if (i%3) == 0 {
                fmt.Print(i,", ")
                }
        }
    }
    ```